app/views/users/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 5
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 97
---

              <span style="font-weight:100;font-size:90%"><%= user.reviews.count %> Stories</span>