app/views/merchants/_content.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 26
SELECT "users".* FROM "users" WHERE "users"."id" = 26 LIMIT 1
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 26
---

            <span class="story-badge-in-profile-text"><%= review.user.reviews.count %> stories</span>

SELECT COUNT(*) FROM "vote_tags" WHERE "vote_tags"."review_id" = 23
---
            <br>
          <% if review.vote_tags.empty? %>

SELECT 1 AS one FROM "reviews" INNER JOIN "vote_tags" ON "reviews"."id" = "vote_tags"."review_id" WHERE "vote_tags"."user_id" = 102 AND "reviews"."id" = 16 LIMIT 1
---
            <% unless current_user == review.user %>
              <% if !current_user.voted_reviews.include?(review) %>