app/views/merchants/_form.html.erb

SELECT "categories".* FROM "categories"
---
         class="textbox-merchant-category">
         <% Category.all.each do |category| %>

SELECT "countries".* FROM "countries"
---
         class="textbox-merchant-country">
         <% Country.all.each do |country| %>