app/views/merchants/show.html.erb

    <% testClass = '' %>
    <% if current_user.favorite_places.include?(@merchant) %>
---
SELECT 1 AS one FROM "favorites" WHERE ("favorites"."user_id" = 102 AND "favorites"."merchant_id" = 104) LIMIT 1