app/views/writestory/write.html.erb

            <span>Average Rating: <%= merchant.average_rating %>
              (based on <%= merchant.reviews.count %> stories)
---
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."merchant_id" = 47


             <strong> <%= merchant.users_who_favorited.count %> </strong>
---
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."merchant_id" = 120