app/controllers/customers_controller.rb

INSERT INTO "customers" ("activated", "admin", "auth_token", "biography", "created_at", "email", "gender", "image", "location", "merchant_number", "password_digest", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "provider", "session_token", "slug", "uid", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21) RETURNING "id"
---
  def create
    @customer = Customer.new(params[:user])

    if @customer.save