app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "merchant_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Tue, 22 Apr 2014 12:14:42 UTC +00:00], ["merchant_id", 104], ["updated_at", Tue, 22 Apr 2014 12:14:42 UTC +00:00], ["user_id", 102]]
---
  def create
    @merchant = Merchant.find(params[:restaurant_id])
    @favorite = current_user.favorites.new
    @favorite.merchant_id = @merchant.id
    @favorite.save