app/controllers/merchants_controller.rb

SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = 118 LIMIT 1
---
  def show
    @merchant = Merchant.find(params[:id])

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
SELECT COUNT(*) AS count_all, merchants.id AS merchants_id FROM "merchants" LEFT JOIN reviews ON reviews.merchant_id = merchants.id WHERE "merchants"."country_id" = 1 GROUP BY merchants.id
SELECT merchants.*, AVG(reviews.rating) AS avg_rating FROM "merchants" LEFT JOIN reviews ON reviews.merchant_id = merchants.id WHERE "merchants"."country_id" = 1 GROUP BY merchants.id ORDER BY avg_rating DESC NULLS LAST LIMIT 5 OFFSET 0
SELECT reviews.* FROM "reviews" JOIN merchants ON reviews.merchant_id = merchants.id JOIN countries ON countries.id = merchants.country_id WHERE (countries.id = 1) GROUP BY reviews.id ORDER BY reviews.created_at
---
  def index
    #@country = Country.find(params[:country_id])
    @country = Country.find(1)

    @category = Category.all

    @merchants = @country.merchants.select("merchants.*, AVG(reviews.rating) AS avg_rating")
                        .joins("LEFT JOIN reviews ON reviews.merchant_id = merchants.id")
                        .group("merchants.id")
                        .order("avg_rating DESC NULLS LAST")
                        .page(params[:page])
                        .per(5)

    @reviews = Review.select("reviews.*")
                     .joins("JOIN merchants ON reviews.merchant_id = merchants.id")
                     .joins("JOIN countries ON countries.id = merchants.country_id")
                     .where("countries.id = ?", @country.id)
                     .group("reviews.id")
                     .order("reviews.created_at")
                     .last(5)
                     .reverse!

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"
---
  def search
    @country = Country.find(1)
    @results = PgSearch.multisearch(params[:query])

    if @results.empty?
      return []
    elsif Category.all.include?(@results.first.searchable)