app/controllers/restaurants_controller.rb

  def show
    @restaurant = Restaurant.find(params[:id])
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", "lazada"]]