app/controllers/sessions_controller.rb

  def create

    if request.env['omniauth.auth']
      user = User.find_uid_or_create(request.env['omniauth.auth'])
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '100003605061577' LIMIT 1