app/controllers/users_controller.rb

  def show
    if params.include?(:id)
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 21 LIMIT 1

  def update
    @user = current_user

    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "biography" = '', "location" = '', "photo_file_name" = '5015354_700b.jpeg', "photo_content_type" = 'image/jpeg', "photo_file_size" = 41102, "photo_updated_at" = '2014-04-23 13:27:10.646647', "updated_at" = '2014-04-23 13:27:13.802744' WHERE "users"."id" = 102

  def index
    @users = User.all
    @thumb_stories = Review.all
    @thumb_stories.sort! {|a,b| a.vote_tags.count <=> b.vote_tags.count}
---
SELECT "users".* FROM "users"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 102
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 102
SELECT COUNT(*) FROM "vote_tags" WHERE "vote_tags"."review_id" = 25