app/controllers/writestory_controller.rb

  def write
  	@country = Country.find(1)
    @merchant = @country.merchants.new
    @merchants = Merchant.all
    @merchants.sort! { |a,b| a.reviews.count <=> b.reviews.count }
    @popular_merchants = Kaminari.paginate_array(@merchants).page(params[:page])
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "merchants".* FROM "merchants"
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."merchant_id" = 31
SELECT "reviews".* FROM "reviews" ORDER BY RANDOM() LIMIT 1