app/controllers/writestory_controller.rb

SELECT "categories".* FROM "categories"
---
  def write
    @results = PgSearch.multisearch(params[:query])

    if @results.empty?
      return []
    elsif Category.all.include?(@results.first.searchable)