app/views/reviews/_index.html.erb


         <strong style="position:absolute; margin-top:10px; margin-left:150px; font-weight:100;font-size:120%;"> <%= review.user.count_thumbs_up%> thumbs</strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 102 LIMIT 1