app/views/reviews/_index.html.erb

<% merchant.reviews.sort_by{ |rev| rev.created_at }.reverse!.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."merchant_id" = 52

  <% unless current_user == review.user %>
    <% if current_user.voted_reviews.include?(review) %>
---
SELECT 1 AS one FROM "reviews" INNER JOIN "vote_tags" ON "reviews"."id" = "vote_tags"."review_id" WHERE "vote_tags"."user_id" = 102 AND "reviews"."id" = 48 LIMIT 1


    <% if review.vote_tags.empty? %>
---
SELECT COUNT(*) FROM "vote_tags" WHERE "vote_tags"."review_id" = 101