app/views/reviews/_merchant_public.html.erb

<%merchant.reviews.sort_by{ |rev| rev.created_at }.reverse!.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."merchant_id" = 118


           <strong style="margin-left:3px;font-weight:100;font-size:120%;"> <%= review.user.count_thumbs_up%> thumbs</strong>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 102 LIMIT 1