app/views/reviews/_profile.html.erb

<% user.reviews.sort_by{ |rev| rev.created_at }.reverse!.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 102