app/views/reviews/_pusherform.erb

<div class="review" data-id="<%= review.merchant.country.id %>">
---
SELECT "countries".* FROM "countries"
SELECT "merchants".* FROM "merchants" WHERE "merchants"."id" = 109 LIMIT 1
SELECT COUNT(*) AS count_all, merchants.id AS merchants_id FROM "merchants" LEFT JOIN reviews ON reviews.merchant_id = merchants.id WHERE "merchants"."country_id" = 1 GROUP BY merchants.id