app/views/reviews/_user_public.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 102
---
<%user.reviews.sort_by{ |rev| rev.created_at }.reverse!.each do |review| %>

SELECT "merchants".* FROM "merchants" INNER JOIN "favorites" ON "merchants"."id" = "favorites"."merchant_id" WHERE "favorites"."user_id" = 102
SELECT COUNT(*) FROM "merchants" INNER JOIN "favorites" ON "merchants"."id" = "favorites"."merchant_id" WHERE "favorites"."user_id" = 102
---
      <div class="store-category-text">
        <strong> <%#= review.merchant.categories.first.name.capitalize %> Category</strong>
        <br>
        <strong> <%#= review.merchant.country.name %> </strong>

SELECT "users".* FROM "users" WHERE "users"."id" = 102 LIMIT 1
---

           <strong style="margin-left:10px;font-weight:100;font-size:120%;"> <%= review.user.count_thumbs_up%> thumbs</strong>