app/views/reviews/_user_profile.html.erb


          <strong class = "story-badge-in-profile-text"><%= @user.reviews.count %> stories</strong>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 102
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 18