app/views/reviews/_user_feed.html.erb


              <strong style="position:absolute; margin-top:7px; font-weight:100;font-size:90%"><%= review.user.reviews.count %> Stories</strong>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = 50
SELECT "users".* FROM "users" WHERE "users"."id" = 50 LIMIT 1
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."user_id" = 50

            <br>
          <% if review.vote_tags.empty? %>
---
SELECT COUNT(*) FROM "vote_tags" WHERE "vote_tags"."review_id" = 5

            <% unless current_user == review.user %>
              <% if !current_user.voted_reviews.include?(review) %>
---
SELECT 1 AS one FROM "reviews" INNER JOIN "vote_tags" ON "reviews"."id" = "vote_tags"."review_id" WHERE "vote_tags"."user_id" = 102 AND "reviews"."id" = 58 LIMIT 1