app/views/reviews/_user.html.erb


          <strong style="position:absolute; margin-top:7px; font-weight:100;font-size:85%"><%= review.user.reviews.count %> Stories</strong>
---
SELECT "reviews".* FROM "reviews" WHERE (user_id IN (SELECT followed_id FROM follows
SELECT "users".* FROM "users" WHERE "users"."id" = 102 LIMIT 1